ndc-pavl-AirShopping_1494866490_1_0.textMatcher

<?xml version='1.0' encoding='UTF-8'?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><AirShoppingRQ xmlns="http://www.iata.org/IATA/EDIST" Version="16.1" AltLangID="EN" PrimaryLangID="EN"><Document><Name>BA</Name></Document><Party><Sender><TravelAgencySender><Name>AgentName</Name><IATA_Number>35200056</IATA_Number><AgencyID>AgencyName</AgencyID></TravelAgencySender></Sender><Participants><Participant><AggregatorParticipant SequenceNumber="1"><Name>Travelport</Name><AggregatorID>00010135</AggregatorID></AggregatorParticipant></Participant></Participants></Party><Travelers><Traveler><AnonymousTraveler><PTC>ADT</PTC></AnonymousTraveler></Traveler><Traveler><AnonymousTraveler><PTC>CHD</PTC></AnonymousTraveler></Traveler></Travelers><CoreQuery><OriginDestinations><OriginDestination><Departure><AirportCode>BIO</AirportCode><Date>2017-11-01</Date></Departure><Arrival><AirportCode>HYD</AirportCode></Arrival></OriginDestination><OriginDestination><Departure><AirportCode>HYD</AirportCode><Date>2017-11-20</Date></Departure><Arrival><AirportCode>BIO</AirportCode></Arrival></OriginDestination></OriginDestinations></CoreQuery><Preference><FarePreferences><Types><Type><Code>759</Code></Type></Types></FarePreferences><CabinPreferences><CabinType><Code>5</Code></CabinType></CabinPreferences></Preference><Metadata><Other><OtherMetadata><LanguageMetadatas><LanguageMetadata MetadataKey="Display"><Application>Display</Application><Code_ISO>EN</Code_ISO></LanguageMetadata></LanguageMetadatas></OtherMetadata></Other></Metadata></AirShoppingRQ></soap:Body></soap:Envelope>